zhiqiangme/STM32_Industrial_IoT_Monitoring_System/STM32_FS/Bootloader/boot_config.h
#ifndef __BOOT_CONFIG_H
#define __BOOT_CONFIG_H

#include "stm32f1xx_hal.h"

#define BOOT_INFO_VERSION                 0x0002u

#define BOOT_ERR_NONE                     0x0000u
#define BOOT_ERR_BAD_FRAME                0x0001u
#define BOOT_ERR_BAD_CMD                  0x0002u
#define BOOT_ERR_BAD_LENGTH               0x0003u
#define BOOT_ERR_BAD_STATE                0x0004u
#define BOOT_ERR_BAD_SIZE                 0x0005u
#define BOOT_ERR_FLASH_ERASE              0x0006u
#define BOOT_ERR_FLASH_PROGRAM            0x0007u
#define BOOT_ERR_BAD_OFFSET               0x0008u
#define BOOT_ERR_VERIFY                   0x0009u
#define BOOT_ERR_NOT_COMPLETE             0x000Au
#define BOOT_ERR_PACKET_CRC              0x000Bu
#define BOOT_ERR_BAD_CRC                 BOOT_ERR_PACKET_CRC
#define BOOT_ERR_TIMEOUT_RECOVERY         0x000Cu
#define BOOT_ERR_STATE_CRC               0x000Du
#define BOOT_ERR_VERIFY_CRC32            0x000Eu
#define BOOT_ERR_VERIFY_SHA256           0x000Fu
#define BOOT_ERR_VECTOR_INVALID          0x0010u

#define BOOT_UART                         USART3
#define BOOT_485_EN_PORT                  GPIOA
#define BOOT_485_EN_PIN                   GPIO_PIN_5
#define BOOT_UART_TX_PORT                 GPIOB
#define BOOT_UART_TX_PIN                  GPIO_PIN_10
#define BOOT_UART_RX_PORT                 GPIOB
#define BOOT_UART_RX_PIN                  GPIO_PIN_11

#define BOOT_RS485_TX_SETTLE_DELAY        500u
#define BOOT_RS485_RX_SETTLE_DELAY        200u
#define BOOT_LED_TOGGLE_INTERVAL_MS       200u
#define BOOT_UART_READ_POLL_MS            20u

#endif
